#Перше завдання
# Замикання в програмуванні - це функція, яка зберігає посилання на змінні зі свого лексичного контексту, тобто з області, де вона була оголошена.
# Реалізуйте функцію caching_fibonacci, яка створює та використовує кеш для зберігання і повторного використання вже обчислених значень чисел Фібоначчі.
# Ряд Фібоначчі - це послідовність чисел виду: 0, 1, 1, 2, 3, 5, 8, ..., де кожне наступне число послідовності виходить додаванням двох попередніх членів ряду.
# Це завдання можна вирішити рекурсивно, викликаючи функцію, що розраховує числа послідовності доти, доки виклик не сягне членів ряду, менших за n = 1, де послідовність задана.


def caching_fibonacci():
    cache = {}
    def fibonacci(n):
        if n<= 0:
            return 0
        elif n == 1:
            return 1
        elif n in cache:
            # return cached result if already computed    
            return cache[n]
        else:
            # compute, cache and return the result
            cache[n] = fibonacci(n-1) + fibonacci(n-2)
            return cache[n]
    return fibonacci


if __name__ == '__main__':
    fib = caching_fibonacci()
    # Використовуємо функцію fibonacci для обчислення чисел Фібоначчі
    print(fib(10))  # Виведе 55
    print(fib(15))  # Виведе 610
    print(fib(8))
